#Задача 2: Найдите сумму цифр трехзначного числа.
#*Пример:*

#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |

x = int(input("Введите трезначное число: "))
a = x % 10 # получили последнюю цифры числа 
b = x % 100 // 10 #получили сначала последние 2 цифры, а потом выделили первую - получили среднюю цифру
c = x // 100 #получили первую первую цифру числа
 
print("Сумма цифр числа:" , a + b + c)