#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
#*Пример:*

#6 -> 1  4  1
#24 -> 4  16  4
#    60 -> 10  40  10
a = int(input("Сколько сделал журавликов Петя: "))
print(a, " - такое количесвто журавликов сделал Сережа")
print(a * 4, " - а такое количесвто журавликов сделала Катя")
print(a * 6, " - столько журавликов вместе сделали ребята")