#Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
#Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
#*Пример:*

#385916 -> yes
#123456 -> no
x = int(input("Введите 6-ти значный номер вашего билета: "))
m = x % 1000
n = x // 1000
a = n % 10 
b = n % 100 // 10 
c = n // 100 
a1 = a + b + c
d = m % 10 
e = m % 100 // 10 
f = m // 100 
b1 = d + e + f
if a1 == b1:
    print("ваш билет счастливый, примите наши поздраления!")
else: 
    print("у вас простой билет. Не рассраивайтесь, вам повезет в следующий раз") 