#Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
#если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
#*Пример:*
#
#3 2 4 -> yes
#3 2 1 -> no
n = int(input("Введите длину одной стороны шоколадки - "))
m = int(input("Введите длину второй стороны шоколадки - "))
k = int(input("Введите количество долек, которые хотите отломить - "))
"""
s = n * m - нашел варинты, при которых дается неправильный ответ (5 5 10)
if (s % k == 0):
"""
if (k % m == 0 or k % n == 0) and k < m * n:
    print("так разделить можно")
else:
    print("так разделить не получится")

